[
    {
        "title": "Software Engineer Intern",
        "company": "Commure",
        "location": "Mountain View, CA",
        "startDate": "Jun 2025",
        "endDate": "Present",
        "description": "",
        "points": [
            "Improving an Electronic Health Record (EHR) platform using React, TypeScript, and TanStack Query to streamline clinical workflows and ease provider workloads.",
            "Designing and testing FastAPI endpoints to support clinical features and efficient data access."
        ]
    },
    {
        "title": "Software Engineer Intern",
        "company": "Code for the Community",
        "location": "San Francisco, CA",
        "startDate": "May 2025",
        "endDate": "Present",
        "description": "",
        "points": [
            "Building a mobile app for the Middle East Children's Alliance (MECA) to share stories, events, and fundraising efforts with their global community.",
            "Developing backend services with AWS Lambda, API Gateway, and SNS, integrating REST and GraphQL APIs to deliver dynamic content and push notifications."
        ]
    },
    {
        "title": "Full Stack Developer",
        "company": "Orsulic Lab",
        "location": "UCLA",
        "startDate": "Sep 2024",
        "endDate": "Jun 2025",
        "description": "",
        "points": [
            "Architected and deployed a PostgreSQL database on AWS, centralizing 100k+ records.",
            "Developed a real-time query platform with dynamic visualizations using Django REST framework, React, and Plotly.",
            "Optimized performance with Redis caching, achieving over 100x faster query speeds.",
            "Provisioned an AWS EC2 instance and configured Nginx as a reverse proxy with DNS and SSL for secure web access."
        ]
    },
    {
        "title": "Robotics Research Assistant",
        "company": "Sensing and Robotics for Infrastructure Lab",
        "location": "UCLA",
        "startDate": "Dec 2024",
        "endDate": "May 2025",
        "description": "",
        "points": [
            "Supported integration of a Python-C++ ROS 2 interface to fuse LiDAR and stereo camera data, enhancing perception pipelines.",
            "Integrated YOLOX SDKs and sensor fusion for real-time object detection and occlusion-aware tracking."
        ]
    },
    {
        "title": "Peer Learning Facilitator",
        "company": "Academic Advancement Program",
        "location": "UCLA",
        "startDate": "Jan 2025",
        "endDate": "Present",
        "description": "",
        "points": [
            "Lead biweekly peer learning sessions for PIC 10B & PIC 10C (Intermediate & Advanced Programming with C++), facilitating discussions and helping peers develop programming skills in a collaborative environment."
        ]
    },
    {
        "title": "Data Consultant",
        "company": "Data Resolutions",
        "location": "UCLA",
        "startDate": "Sep 2024",
        "endDate": "Present",
        "description": "",
        "points": [
            "Collaborate with external clients to derive actionable insights from data and strengthen data processing pipelines."
        ]
    },
    {
        "title": "Frontend Developer",
        "company": "Association for Computing Machinery (ACM)",
        "location": "UCLA",
        "startDate": "Apr 2024",
        "endDate": "Apr 2025",
        "description": "",
        "points": [
            "Enhance ACM at UCLA's website, built with Next.js, which was recognized with ACM HQ's Outstanding Website Award among 680 chapters.",
            "Responsible for integrating the new ACM Cloud committee and launching partnership and alumni pages."
        ]
    },
    {
        "title": "Digital Transformation Intern",
        "company": "IMDA",
        "location": "Singapore",
        "startDate": "Jun 2024",
        "endDate": "Sep 2024",
        "description": "",
        "points": [
            "Researched and formulated strategies to support digital transformation and commercialization of SMEs to drive industry-wide impact.",
            "Collaborated on a generative AI POC, cutting preparation time by 85% and advancing as a finalist in an internal hackathon."
        ]
    },
    {
        "title": "DevSecOps Engineer Intern",
        "company": "DSTA",
        "location": "Singapore",
        "startDate": "Jul 2023",
        "endDate": "Sep 2023",
        "description": "",
        "points": [
            "Deployed a knowledge platform in an air-gapped network using Docker and Kubernetes.",
            "Secured connections with Nginx reverse proxy and configured DNS for network routing.",
            "Automated server setup and maintenance with Ansible and shell scripts."
        ]
    },
    {
        "title": "Software Engineer Intern",
        "company": "HTX",
        "location": "Singapore",
        "startDate": "Jan 2023",
        "endDate": "May 2023",
        "description": "",
        "points": [
            "Developed a Python Telegram bot to automate social media monitoring and issue threat alerts.",
            "Initiated a topic modeling pipeline to detect emerging trends from data streams.",
            "Created a web dashboard with React, MongoDB, and Flask for historical analysis."
        ]
    }
]
