[
    {
        "displayName": "pill.ai",
        "repoName": "pillpro",
        "caption": "LA Hacks 2024 - Healthcare Track Winner",
        "displayDescription": "pill.ai is an AI-powered platform that prevents prescription errors by verifying medication images and doctor-patient audio using Google's Gemini API. It empowers patients to take charge of their medication with a user-friendly dashboard, enhancing medication safety.",
        "image": "pillai.png",
        "links": [
            {
                "text": "Devpost",
                "url": "https://devpost.com/software/pill-ai"
            }
        ],
        "technologies": ["Gemini API", "React", "Material UI"]
    },
    {
        "displayName": "JARVIS Health",
        "repoName": "jarvis-health",
        "caption": "TreeHacks 2025",
        "displayDescription": "JARVIS Health is a tablet application designed to monitor soldiers' health during training. It aggregates heart rate and exertion data from wearable devices via the Terra API, providing commanders with a real-time overview of multiple soldiers' physical states. The platform uses OpenAI's GPT-4 models to analyze data and offer actionable insights, supporting data-driven decisions for safer and more effective training.",
        "image": "jarvis.png",
        "links": [
            {
                "text": "Devpost",
                "url": "https://devpost.com/software/jarvis-health"
            }
        ],
        "technologies": ["FlutterFlow", "Firebase", "Terra API", "OpenAI API"]
    },
    {
        "displayName": "Personal Website",
        "repoName": "cweihan01.github.io",
        "caption": "My Portfolio & Learning Space",
        "displayDescription": "I created this site to document my projects and experiences while exploring Vue and front-end development. Having primarily worked with React, this project provides an opportunity to discover new ways of building with Vue. The site is very much a work in progress, and I see it as a space to experiment freely, learn through building, and continuously improve. Thanks for stopping by!",
        "image": "website.png",
        "links": [],
        "technologies": ["Vue.js", "GitHub API"]
    },
    {
        "displayName": "remembrall",
        "repoName": "remembrall",
        "caption": "UCLA CS35L Final Project",
        "displayDescription": "Built with the PERN stack, this full stack web application helps users manage tasks effectively. It features an interactive drag-and-drop task list, a friends system, and dynamic search filters, making task management intuitive, collaborative, and efficient.",
        "image": "remembrall.png",
        "links": [],
        "technologies": ["PostgreSQL", "Express.js", "React", "Node.js"]
    }
]
